day06_RailsDatingReact/dating_app_api/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    @users = User.all.sample(6).partition.with_index {  |_, index| index <= 2 }

INSERT INTO "users" ("name", "starsign", "age", "img", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "sad"], ["starsign", ""], ["age", 0], ["img", "asd"], ["created_at", "2020-09-22 01:11:07.462303"], ["updated_at", "2020-09-22 01:11:07.462303"]]
---
  def create
    @user = User.new(user_params)

    if @user.save