daywise_work/day07_Temperatures/temperatures/temperatures_api/app/controllers/temperatures_controller.rb

  def index
    @temperatures = Temperature.all
---
SELECT "temperatures".* FROM "temperatures"